app/controllers/school_classes_controller.rb

  def create
    @school_class = SchoolClass.new(school_class_params(:title, :room_number))
    # @school_class.first_name = params[:first_name]
    # @school_class.last_name = params[:last_name]
    @school_class.save
---
INSERT INTO "school_classes" ("title", "room_number", "created_at", "updated_at") VALUES (?, ?, ?, ?)  [["title", "dogwalking"], ["room_number", 1], ["created_at", "2017-04-13 01:25:38.434648"], ["updated_at", "2017-04-13 01:25:38.434648"]]