app/controllers/students_controller.rb

INSERT INTO "students" ("first_name", "last_name", "created_at", "updated_at") VALUES (?, ?, ?, ?)  [["first_name", "bob"], ["last_name", "smith"], ["created_at", "2017-04-12 22:24:02.262801"], ["updated_at", "2017-04-12 22:24:02.262801"]]
---
  def create
	  @student = Student.new(student_params(:first_name, :last_name))
	  # @student.first_name = params[:first_name]
	  # @student.last_name = params[:last_name]
	  @student.save